eisup_2019_docmng_integration/src/Documents/РезультатИспытательногоСрока/РезультатИспытательногоСрока.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатИспытательногоСрока</name>
  <comment>(Общ)</comment>
  <registerRecords>InformationRegister.НамеченныеСобытияПоПерсоналу</registerRecords>
  <registerRecords>InformationRegister.СостояниеРаботниковНаИспытательномСроке</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>EnumRef.РезультатыИспытательногоСрока</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьРаботники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияРешения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Решение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/СостояниеРаботниковНаИспытательномСроке/СостояниеРаботниковНаИспытательномСроке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеРаботниковНаИспытательномСроке</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияРаботникаНаИспытательномСроке</types>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/НамеченныеСобытияПоПерсоналу/НамеченныеСобытияПоПерсоналу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НамеченныеСобытияПоПерсоналу</name>
  <comment>(Общ)</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаниматьСтавку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланируемоеСобытие</name>
    <type>
      <types>EnumRef.НамеченныеСобытияПоПерсоналу</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/РезультатыИспытательногоСрока/РезультатыИспытательногоСрока.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыИспытательногоСрока</name>
  <enumValues>
    <name>Положительный</name>
  </enumValues>
  <enumValues>
    <name>Отрицательный</name>
  </enumValues>
  <enumValues>
    <name>Продлен</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/СостоянияРаботникаНаИспытательномСроке/СостоянияРаботникаНаИспытательномСроке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРаботникаНаИспытательномСроке</name>
  <enumValues>
    <name>ПринятНаИспытательныйСрок</name>
  </enumValues>
  <enumValues>
    <name>НеПрошелИспытательныйСрок</name>
  </enumValues>
  <enumValues>
    <name>ПринятНаРаботу</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/НамеченныеСобытияПоПерсоналу/НамеченныеСобытияПоПерсоналу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НамеченныеСобытияПоПерсоналу</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Заболевание</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтгулВСчетЕжегодногоОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезСохраненияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ОтпускЕжегодный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПрочий</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебный</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетПоНевыясненнойПричине</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>РезультатИспытательногоСрока</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>УвольнениеПослеИспытательногоСрока</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/РезультатИспытательногоСрока/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем мУдалятьДвижения;

Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)
	
	// Сотрудник
	НетФизлица = НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Физлицо);
	Если НетФизлица Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;

	// Результат
	НетРезультата = НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Результат);
	Если НетРезультата Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указан результат!", Отказ, Заголовок);
	КонецЕсли;
	
	// ДатаИзменения
	НетДатыИзменения = НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаИзменения);
	Если НетРезультата Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Не указана дата изменения!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НетФизлица И НетРезультата И НетДатыИзменения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВыборкаПоШапкеДокумента.КандидатПринятНаИспытательныйСрок Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("Кандидат не принят на испытательный срок!", Отказ, Заголовок);
		Возврат;
	КонецЕсли;

	Если ВыборкаПоШапкеДокумента.ЕстьРешение Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("По кандидату на дату решения уже присутствует решение!", Отказ, Заголовок);
	КонецЕсли;
	
	Если ВыборкаПоШапкеДокумента.ПланируемоеСобытие <> NULL Тогда
		ОбщегоНазначения.ВывестиИнформациюОбОшибке("На дату решения по кандидату уже запланировано событие: " + ВыборкаПоШапкеДокумента.ПланируемоеСобытие, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, СтруктураПараметров = "")
	
	Если ВыборкаПоШапкеДокумента.Результат = Перечисления.РезультатыИспытательногоСрока.Положительный Тогда
		Движение = Движения.СостояниеРаботниковНаИспытательномСроке.Добавить();
		// Свойства
		Движение.Период				= ВыборкаПоШапкеДокумента.ДатаИзменения;
		// Измерения
		Движение.Физлицо			= ВыборкаПоШапкеДокумента.Физлицо;
		// Ресурсы
		Движение.Состояние			= Перечисления.СостоянияРаботникаНаИспытательномСроке.ПринятНаРаботу;
		
	ИначеЕсли ВыборкаПоШапкеДокумента.Результат = Перечисления.РезультатыИспытательногоСрока.Отрицательный Тогда
		Движение = Движения.СостояниеРаботниковНаИспытательномСроке.Добавить();
		// Свойства
		Движение.Период				= ВыборкаПоШапкеДокумента.ДатаИзменения;
		// Измерения
		Движение.Физлицо			= ВыборкаПоШапкеДокумента.Физлицо;
		// Ресурсы
		Движение.Состояние			= Перечисления.СостоянияРаботникаНаИспытательномСроке.НеПрошелИспытательныйСрок;
		
		Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
		// Свойства
		Движение.Период				= ВыборкаПоШапкеДокумента.ДатаИзменения;
		// Измерения
		РезультатИспытательногоСрокаПереопределяемый.ДополнитьДвижение(Движение, ВыборкаПоШапкеДокумента);
		
		Движение.ПланируемоеСобытие	= Перечисления.НамеченныеСобытияПоПерсоналу.УвольнениеПослеИспытательногоСрока;
		Движение.ДатаИзменения		= ВыборкаПоШапкеДокумента.ДатаИзменения;
		// Ресурсы
		
	ИначеЕсли ВыборкаПоШапкеДокумента.Результат = Перечисления.РезультатыИспытательногоСрока.Продлен Тогда
		Движение = Движения.НамеченныеСобытияПоПерсоналу.Добавить();
		// Свойства
		Движение.Период				= ВыборкаПоШапкеДокумента.Дата;
		// Измерения
		РезультатИспытательногоСрокаПереопределяемый.ДополнитьДвижение(Движение, ВыборкаПоШапкеДокумента);
		
		Движение.ПланируемоеСобытие	= Перечисления.НамеченныеСобытияПоПерсоналу.РезультатИспытательногоСрока;
		Движение.ДатаИзменения		= ВыборкаПоШапкеДокумента.ДатаИзменения;
		// Ресурсы
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = Не ЭтоНовый();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОбработкаКомментариев = глЗначениеПеременной("глОбработкаСообщений");
	ОбработкаКомментариев.УдалитьСообщения();
	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ttk_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	РезультатЗапросаПоШапке = РезультатИспытательногоСрокаПереопределяемый.СформироватьЗапросПоШапке(Режим, Ссылка);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			// Заполним записи в наборах записей регистров
			ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента);
		КонецЕсли;
	КонецЕсли;

	ОбработкаКомментариев.ПоказатьСообщения();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
